l_strEncr = [
    """ТДЮКТ ЧЩЭНТ ИКВЮЫ ШЗЬТК ЛМКШК ТКЩМЫ ГКШКТ КЩМЫГ КДЮКР ФМЭКМ КЙКХБ ШНЪЕЦ ШЙЧЩХ РКМБК ШВБЫХ
ЭЗАЭЦ МЩШЕБ КХБШН ИЫШЫБ ШНЪЕР КМБКШ ВБЫХР ФМШЩР КМЕЛК ИКЧКВ ЮЦТЩВ ЕЭЦБЧ ЦВЫТФ ХЭКМК ЙКХПЩ
МКТЩБ ВКЯЧЩ ЙЩМЩШ ШФЭЫЫ ВЗУЫЭ ЫПЩЧЮ ЦЭЫТВ ЩТЩИК ОЫИЗЧ ЩШЦПЫ ШЦНКЮ ЗВЮЦМ КИКВБ ЗПЦЬЖ ЩИКТЪ
ИМНЙЦ ЙКЮЫУ КИКЭЩ ЧШКИК ЛЦИЦЯ ЧЩЙВЮ ЦТМНМ КВЦЭЗ ЬЧЩЪБ ЗЬЯЧК ЮЫТКЯ КМКАШ КВЮЕВ ЩИКЭЦ МЩШЕБ
КЬКАЫ ТМЩШШ КЬАЩШ КХ""",
    """ФАЛЯО ЖОАГЯ КФТЙЯ РОФЯЬ ГКБОП ГВПФБ ГУЦЭГ ТЙУОЗ ПЪЭГА ЙПГЛЮ ПЪЖГФ УОФАЛ БЪЭЩБ ГОКАГ БЧФБЦ
ПЪПОМ ОКУЛР ЪБЦОМ ФАЛТЙ УГГЩФ ПЦКЭЛ ЩПГОЗ ЯКФМЮ ФДЧОК ЭЛЩОЯ РОМФА ЛУОЫУ ОЫГФЬ ГМГЧГ РФПЦЭ
ГВЮФП ЙЭЪЗЪ УГКЦТ ГУЦРФ ЯКФМФ АЛПЪЖ ГФУГК ЬЧОАЪ КГВДГ ЧБОЯР ФСФЬГ ЭЧЪКО ЯГФУО ЫГГПГ БЯФЧП
ЛУКШГ БПФФГ ПДГЫФ УГЯЪУ ЧЛЭЛЪ ППЙДЪ ЯУГЯП ЙОИЛЧ ШКЦГЬ УШЖФУ ЯКФГТ ИФКБЯ Г
    """,
    """ЮХУМЭ ШЮЭТУ БУТСТ ТБСРЪ ЦФЭСЦ МЪХСХ НЗЙЮЦ ЕХКТН ТОРОС ХКХЮЮ ТЭБОТ ПЪЮШП РУЦБЭ МЭЙПЮ ЦМДСХ
ЭНЦПБ ХХКНЦ ПЭУОС ХТВТМ ЭКЗХЮ БСЦМФ НХБЭС РПЦУБ ТЫЪСХ ТЖХФН ХБЭСС ХУБЪХ НТТИЩ ЮТМРП ШКЗМХ
КЗФНХ БЭСРП ЦБТКШ ХЮНТЕ ЪХЩФХ СНТКМ ШМБУХ ТУМЭШ ЮЭТУЕ ТМТЪЮ ШЖЭЮЭ ЕНЩКТ АЪХЙХ ЮФХОЩ УБСУХ
УЦМХЕ ЮЦЪХФ ХБМТТ ТЮХУХ ЖХФНЭ ПЗУЦО СХСХУ НХЕТЩ ЪХНЦБ ХУТБС Э
    """,
    """ДХМХМ ЭДЧХТ КМВЧГ ЭШМБЯ ГЭВШБ ЖЧТЬМ ЙМЧТС БДТЧТ БСКГП ИВДХИ ЖКДИЮ ОМХВВ ДНЪГУ ШДЧВН ДЙДДХ
БТЯВК ЭДВВЭ ШТВЧМ ЧЦНДД ХМДЯХ МТОНВ ФПВХА ТХДСД ИВХХД ЧМНВШ ВЕУДН ДШЖВД ЯХМПЯ ЖБОЮБ СВИВЦ
НДХТИ ГЯЛБЙ ДКДБГ ХВДНС НМХГН ЯДНВФ ЭДШЭД УМХВТ СЭДКХ ЮНТФП ВКМХТ ЮМБЭШ ДНТБХ ДЧСКГ ЦМВЙД
НДБЖХ МВПВЯ ХВБХЖ ВВПВЧ ТХГНХ ЖВЭШТ СНМБМ ХТЮТЯ МПВХМ СЪВХЖ РНДЭД СКВЯХ ВВСДД ИШМПВ ХТВЭД
УДКВИ МКДВЙ Д
    """,
    """ЩЭГМС УШТГЗ ЕШКЖП ВШОПУ ЛХУЯГ ВСУЕТ ВХГТТ ВРВМВ ОПАЯН МВЕНЛ ОВРМВ ЮТУЮН ЕМАОТ УЮНМЗ ЕАЮНВ
ТЕАЕР ВХВМН ПОЪТГ ЗЮГШХ ВЛПНХ ОАШВТ НГБГЮ ГТГГЗ ЮГШНЦ ТГРВХ УЛПНП ВГОПЭ ЩГМГЫ ХУДВЫ ВЮОЕА
ЦАПЭИ ПВТНС ЗЫЭВО ВСГТТ ВЩМНЪ ПТВГЕ МВЮГП ВРВВТ СУШМА ООГЪТ ХОПАХ АЪВТХ ЮГОПВ ОХВГЛ ЯШЪЩУ
ЦАДХА ПНШПМ ГДЗРВ ШЭТЗК ЯШЪЩЗ ОРГТГ МАШЭО ЕНЮЩШ КЮАЖГ ЮНЫГМ ЖАШГГ ЫГМРА ЪОЗШП АТЫВП ГДЩВМ
ЩВЕАР ГТГМА ШТГЩВ ЩМВОН ШХВЦХ МАПНП ЭГГ
    """,
    """ФКЪЗЛ БВНЭЫ ЭЙЯХЮ ЖЭЯСО ЭАМХЧ ЕЪЫВЛ ДЪБНЮ ВЭЪАЭ МЫФАХ ЖЭЯЕЗ ЛБХСП ЖЕЮОХ ЩЧЪНЪ ЫЗФЫА ЮОХЩЗ
ЪЮЮФУ ЫХЯЖХ ЩЖЭЯЕ ЧЕЪЫЮ ЪБВСИ ВЭИЯС ЯЕПОЭ БЩЮОФ ЮЖХУЪ ЫЪЖСЪ УЪЦХН ЕМЭУЭ ЙЖЭЯЪ УЗБСК ЪЭЖЧЭ
МТЪИК ХБНЪУ ЗЭБЪЪ ЭЖЯФВ ЮНВЭВ ХБЖЪВ ЭИУЭК ЖЭЮНЕ ИХЮЖФ НЕВШН ФЖЭЯЕ ЧЭЦЭМ СВДФП ЗЭБЪЪ ЖХВЪЯ
ЪЫСБС ЖХФНЫ ЭМХБЪ ОЭЗЛБ ЭВСМЖ ЭЧЭЧФ ЮНЛУФ БСРХУ
    """,
    """КЛТЖЬ ОЯАФФ ХЫЦЭЗ СДЛЦЭ ВЛМЛТ ЛЮЯСФ ЛИИЛМ АЯХТЬ ЩГФЪО ФЯНЯХ ЮАФЛЙ ЛХЫОР ЪЦЯИЯ ЙЛЦЭЛ ИКЛТИ
УЦГУИ ЯЛГАЬ ЧЬИИЛ ЬФХЫЦ ЭЗЛИЯ ЦЬГЙИ ЪЗСЪА ЛВЬЦА ЛЙАЛХ ЬИИСБ ТАЬХЭ АКЬХЬ ТИЬЩИ ЪФЛМЛ ИЬДЫЦ
ЛАЯЦУ ЦЪГЭК СГЙЫЬ ДСЙЫЦ ФЪКЦЯ ЧЪФЯЦ ЛВЪКЯ ОЦЛАЪ ИЛЮГЦ ЫВЯЦГ УТЯЦЭ ИЪЩМЛ АЛХЪФ ХЪФЪМ ХЯЪСР
ЪИСРЬ ФЛИПЪ ЦЪГЭИ ЛМЛГЙ ЪЬЧЬИ ЬХЯНЖ ЬНРЯЦ ЪГЭКЭ ЬХГФЪ ИСЦКЦ ЯЧЪАЛ ВЬЦАК ЬХАСБ ФЛЮИЯ ЙСМТЬ
ГЙЛУЦ ЪЛГЙЯ ЙФЪСР ЪИЯЪЛ ТЪИЦЯ ФЬЩТС ЮЯУПЙ ЛЬМЛИ ЪФЙЛИ ЬАЪТЪ ЙТЛКЪ АЯЦЙЯ ЩФЛЮИ ЬТЛКЪ ЙЫЬГЙ
ЯФЯИЫ
    """,
    """ЩГЮПЦ СЙАЕУ ЕЧЕАЖ ЫУГЕУ ЫДМВЙ ГЕМФЙ ГГЫМГ ЙСМКМ ЯМШЙГ ГХЖЙС УЫСГХ ЩГЮЗЕ ГМФЯШ ДМИЩЫ ЧЖЯЫА
ЕСЛМЧ МЗЫЫА СЫМЪМ ФЕГАБ СМГГЫ ЪАХГМ ДЫЯЕА МЫГМЪ ДХУЫФ ЫУЫЬМ ГЫЗЫА ШФЙЯТ ЕГМСЖ ЯЕЪМЯ ФЯШЗЕ
ЪЫГДХ УЖМЯМ СМФМГ СЗСЙЯ ФЕТАМ ЪМГЫС АЩЫЗЫ ЖЫУЩЙ ЖЯЙЖЫ ЯВЕЩЫ ЪГЫЙФ ЭТБЙГ БЫЪЕУ ЕАЫАБ ЫЮВЕЪ
ЖЯЕЩШ БШПЫС МДЫЯЕ АБЙЩЕ ГМДХУ ГЙПГЙ КМГГМ АЪЫБЯ ЮГЙСА МРУЫЖ ЫБХЕЖ ЯЫЕАЩ ЕЙГГХ ЪЕРЙЧ УЫСГХ
    """,
    """ЛЖКУЦ ВНУЖЗ ВЛВЙВ ЦЧЧЪЪ ЩНЧЛЗ УЛЪЩЧ ЪЪЧЯА ГЧМЗУ ЛЪЧЛВ ЦЪОЗЧ ЖЬЛЯУ ЖКЛОН ЦЫЯУК ЖЛУАЯ ШУЭЧИ
ЩЯЦУХ ЖИЛВЪ ЪАКЧЯ ЦУЖИУ ЛЩЯОК УИУЦЩ ГУЪЧЖ ИУЫЗЧ ЛЯУЖК ЛВАОК УИУЦЩ ГЖХВИ ЖИЛЧЛ УЖНАИ ЩЛЧЗЖ
ЫАЭУХ ЧЯАТА ЛЧЗВВ УШУТЧ ВЯЩМШ УЦВЪЬ КЧИУЗ ЬКУЙИ УНЦУА ФЛВХВ ЪЪЩМЛ ЧЦЯВМ ЖКАВА ИУИЙЧ ЖТВНВ
ЦВЛВХ ВЪЪЩМ ЛЭЛЧЦ ХВМЖК АВНЦЧ НУЦЕА КАЭЛЧ ЦХАЫО ТВЛЩБ ЗЧАФН ВИВЦШ ОЦЭЧЭ УЧЛЭО ЖИЧАЖ ЩЪУЖИ
ЧЛБАМ ЖЫХЗЫ УШЯОЪ ХАЦУЛ ЧЪАЫЛ ЯУЖКЛ ВХУЗТ ВЪШЩЗ ХУЭЪЧ ИЬВВН УХУЦУ ЭВЛЦЧ ХФАЛА ЗУЛ
    """,
    """ЕЦБОД БМЭЪЖ ЭХЮЮЛ СЧЮЧЧ ЮАЭЧЯ ДЯХФЮ ЛЯДФЮ ЛСЧФЫ ЯВИБР ФОЕДЦ ЯЧСШС ЦСОДЯ МЯВШБ ИЗСТГ ЯХЮЮБ
ДЗСТГ ЯХЮАЕ НЮШБИ МБТЮМ ЫЮСШБ ТИЦЯМ ЮДСХС УЬЖБХ ФЫБЛЕ МОСУЛ БОЬМС ЮТМСО ДЧБЛЕ ИБЛЕН ЦЯЙЮЧ
ЮЦБОД БМБУЧ ЯШБМЯ ЦОЬБУ НЦЯЙЮ ЧВОЬЦ ЯОЮМБ УОДЯЦ ЫСКИБ РСЦФК ЮНБОД ВЛЮЧС ШСЦСО ДЯМЯМ ЫЮЛЮО
ЛСЧВД ФБИЮЧ ИЦЕНБ НБОЮИ СХЮМН БОДЮЧ БУ
    """,
    """ЮРЬЙЖ КБМПО ЬЛФКЯ ЖКЬЗГ ЦЗЭЦУ КПДЭЖ ЫЦДЩН ШЦЮЦО ЖИЬОФ ЭЗЦРЦ СЬЫБЭ ЖГЖШЖ ДЦЖАК НРФКК ЬБШФЭ
ТДЖСЦ ЭЦРПЩ НКФЕМ ПОЦШГ ФКЬШИ ЬЭТУФ ОЦГФС ДФШОЖ ЭФОТК ЦЗЭТФ ФШГЖЛ ФКЖЕЖ ЮЦГЦР ЬЫРЦЖ ЗЩЦШЖ
ГВЬБЦ ЭЗОЬМ ЦЗЭЖЗ ЖОЫРЖ ШЬГЬО ЬФЕАК ЬУЖЭФ ОТКПЕ ГЖШГК НВЬГВ ЖЕНГЬ ЛФКЖФ СКБЮЖ КБЬКК ЬДЖЩЬ
ЕОЦГК ЬШРНМ ФИСЬБ СЬСШЦ ДЬВКЖ ЕУФОЦ ГФСЗЖ ШФОЬЭ НЭЛФЫ ЦДЦЮЬ БГШФО ФЫРЖК ЖДЬКЖ БЖАЬК ЖДЬКЖ
БРЬАЮ ЦГЦРЦ ДЮЦЗЭ ФЕ
    """,
    ###10
    """ЗЙЭЦЩ КЩЗЮИ ГИКЩЙ ИЪЭВН ЛЗИОН АЩЧАЬ ИПЗПЛ МБСВЗ ИНВНЙ ЭРЮКА ЩЗОАЖ КИНАЩ РЭЪПЭ ВАЙЮО ЩОИХЩ
ЖЩДАЗ ПЛЫОЭ ЗПЛЫЭ РЩПАВ РЮКЙЮ ВЩЪАШ РИКЩЪ ЛПЮШТ ОЩУЭВ ХПЭЙА КБОЮЦ АНЩОЪ АЦАГИ ПНЭЦА ВХЩЪЩ
ШОЩЫЩ АЪПЭВ АЙЩЫЩ КАЬЭО АЪЩКЭ ШРЮКО ИЙЮВЩ ЪАШЪЛ ПГЭЙЮ ШЦЩКЩ ЗЩШГИ КЩЙИЪ ВЩНЪП ЮНЮЦЙ ЮПЭДИ
ОАИЦК АЬЭОЭ ЙИПЖО ИШЫЛР ИИЫЩЛ ДИХЩЪ ЭМЮЙЭ КАВБГ ИПОЮИ ЙЩКЩВ АЪААЙ ЩЙВИЦ КАЬИЙ ЮПЭДЭ КАВБВ
НПИЦА НИКБО ЩВНБА ЙЩВНЩ ПДИОО ЩВНБ""",
    """
МДЗЫУ ХУШУП УСЕПТ УЖЧЗД ГШЖХД ЛЖБДЬ ВНУТУ ДХУЫД ЬВНУТ УШДТА МДЫДЩ СВШДО ХДЛСК ШДЛМД ИХУШВ
ДХУДГ ШУХДС ЖТУГА БЮЖГТ ЭПЖСУ ФГАМЗ ДСДЮЭ СЗДГШ ЖХДЛЖ ДНЖЫУ ФСЕЯД ЫУЬДЮ ЖГУДХ УЭНВХ УОЖХУ
ТУБЮЖ ЯДЫЖШ АСХВШ ВЮБВХ ЖВЖШД БХЭСХ ДНМДЛ ГЬЖЮУ ТУГАЬ ЕТДЧУ БТУМУ ШАДШШ ДЗДОШ ДДХХВ ГВЛОУ
ГПВТМ ДЗЫУЧ УГТЕП УТЖГА ХВШЖЯ ЖВХВЬ ЕГШЮЕ ВБЮЖТ ЖОХЕВ ПУЗЖИ ДТДЫД ЗДОВТ ДСВМУ""",
    """
ФЩГПБ ЩБКДЬ ЩВПЛБ ТИЩБР ГРЧПО ЩЪЬДК ЕЩЗЛТ ЬСЛБТ БЪДЮЬ СЛГСО ЩАБЩГ ПЬОПБ ГСОДВ ДЪСЬЧ ПГДПИ
ЩЧЩЦР ЛОЯРГ ОДЛСГ ДББЪД КГПВД ТБВЩР ОГДБП ВЩРЛП ЫЩЬДК ДЦДИГ ПКПЮЬ СВВЕЗ ЛТЧЕВ ДЛДПЯ БВЩРА
ЯДБДЧ ЕЩЖПЧ ДТХКЩ ЩЬФСЧ РКЧРЛ ДКЭЩЬ ИЩБКЩ ТЛЬРБ ОЩЛЭО ЩВГРЪ РЬПИР ГРЧЯР ГОДЛЩ ЪСЛЕФ ЬСЛБТ
ПИЩЦР ЛОВЕЮ ЩЧЬЩА ЧВРГП ЬДКДЦ ДЮЩКР ЛДРЗЩ ЩОЛПО ЬСКЭЬ ЩИЩКЩ ЪГДЯЧ СЪДЛД
""",
    """
ЮХНЧУ ХГЮХО ХЯФЭТ ЛВЕНУ КУФМС ЯЩЪХЙ СТЕЯФ ТЛВНК ЯКЭУЯ КЭАЕТ ВКЫЭЫ ЭХАЫЭ УТХМЧ ЭНЕМЛ ГЮХЮХ
МНХОА ХВЕДГ ЩРКЫА КЮКВК ЩСЕЯЖ КНКЭЧ ХЮЭТХ ЕЪХДЕ ЯТХЪХ СТФЖЕ АФЫТЛ ОЕЖКЮ ЧУАЕЙ ФХЭЮК НКЭЧТ
ЭТХЕЙ МКЭКС ЕУКУД ХСВКД УХЙАЕ ТФСФЦ УХЙТЛ ЭЦКЮЯ ФТКЫГ ЮХСЕН КНХЭЧ АКЭТЕ ЮЕХАК ФЭДЛЮ ЛТКНК
ХЭХОХ ЕАХТХ ЕАКЭН КЖСЕА ФЕЭХА ЫВЕДЮ КНКГЮ ХЮХФХ ЪНЫСЛ ТКНКЭ ЧАКСТ ЕЯЧЪХ ЭЮФАХ ЙФМСТ ЕЯФТЛ
ВЕНАФ УХНКЙ
""",
    """
КСЙЖП ЗДХЙР ЩГХЙШ ЙЯХТП ОПХЯТ ЧХЯЗЪ ТЪШЪШ ЙФСПЗ ПЦЙХМ НЯШМЮ ЪЗПРЯ КЯПЮТ ЪЬВЙС ЩФСПР ЙОЙЗЯ
НАШЯХ ЯШМРЯ ОТЙХМ ЗЪФСЪ ЦЪЗЗЯ РЩЮЙХ МТГЪЭ РХЯНЩ ИЪХЪБ ЪФСПЪ ОЛЙХМ ГФЯОИ СЙТШЪ ЗПДЦП КСЙЖП
ЗЪЭЯХ ЪШЯГМ ГКШЙО ЩЗЙКШ ЙОФЯК ЯТЯСП ХМГИС ЩКЯЦГ ТЯЪКЯ ИЪХГХ ТЙРЗД КПЗЪЬ ЙЗЗЯЬ ЦПЭЙЬ ШЯТЗЯ
ЬРЯХЯ СЩУЯЗ ЙЗЪТП ИЙШЙЭ ЯСЯЮЪ ЗМРЯГ ЪЪФСП ЪОИЙП ОФЪХЪ СНЩСК ЙЙЗЗЙ ЦПЭЙЬ ШЯТЗЙ ГГТЯП ЦПГФШ
ЙРЙЗЗ АЦПФС ПДХЗА ЦШПВЯ ЦФЯИТ ПЗЩШЙ ГМНШП ЛЪРРС ЪГШЩК СЙЖПЗ П""",
    """
ЮДЬФХ ТНЛКЬ ГМЮЬЧ ИЫУФТ ХДМЬУ ЬНТФД ЬФЫИЮ ЬХЬФУ ГФПЬЛ ЪЬБМХ ИЛХЬЧ ДКЯУЫ ЧИЫМЧ ТКИОЯ МНИГР
ТУГБМ ХИЯЛМ ХЯФЛЭ НЯХЯФ ГЙФТМ МНТРЫ ИТЧЛГ ПФТЕТ ФЯМХЯ ИТУЫЧ ТМЮФТ ИЬЪЧЛ ИТЮДЬ ФГЖТМ ХИЯИТ
ЧИМИЭ РЫИТК ДЛНИТ ФХТЧД КЯПЯМ ОЬЪИЬ ЪЬОЯК ЮФЛЬЗ ТЧКЬМ НЯЧДН ЯЪКЬБ ХЯОГК ТРТЪЛ ЯМХТК ЯИЛЧМ
ЭНТНИ МЬПЪТ ИЪЯОЬ МИЯЬП ЯЯХАТ
""",
    """
ЕЯАЗЯ ЪМИХЭ КИЯБЙ ФЙБЮА ЯМШАЯ ХМЗЭФ ЯЫЩЭМ СРЭША ЪЙРЖЯ ШГРЭМ ЮАЯКЙ ЖПЯГХ ЫЩЙЛО МЭЭФЯ ЯАТЙР
ШЭФКЙ ЪЭКЯУ ХЯЩЭБ ЙАЭБЦ ЪПЭГЪ ЭЖЫРЯ ШИЯБЦ СЫЛАШ ЗДАМЖ ШБЫЮЙ ЭЖЮАЯ УПХЙС КХЙЩМ АЦФХЙ НЙЯЪР
ШЭАЙГ МРКЭЪ ЦИХМЭ СКЙИЯ ЬЭБЪЙ ИЯБЯР МЪЫЯА ТЙРЯЧ КЗРФЯ ШАМЪЫ ЛЯУПЮ ЪЯЭЖЭ ШАЯИХ ЭУПРЙ ЪМЭГЪ
ЗЩЭЪЯ ЪИЯСК ЯХЯРЙ БШЗШК ЙЖЙЖМ ШМКЭР ЬМЖМС ЙИЗБЦ ТЙЖММ СЙГЪМ ФЯЧГЯ АЯХЫЛ РШБЫЕ ЮМАЙБ ЙЯКЪЙ
МСЪМЕ МЕУПБ ЯАХМ
""",
    """
ДОЩРП ВСХОБ ГПБВП ГЩРРШ ХРДОЦ РБПГТ ИПОЩВ ЬВЪОД РСОРЦ ЗШЖХШ РСТГД ГУРПЖ ДРСЭП АКЩРС ФШРШР
ЪРУРЬ ОПХДГ СХРДЗ ЭПАКВ ПВХЖЦ ВЬВБД РДРУО БОЙРЙ ЭФОПВ ХЖЬГУ ДРХШЖ ИШРКП ГБДГП ВШРЩЬ ВХДГП
ВОУХГ ЙОХОП ВЙОЦЬ ОХПЭН ОУВПВ ХЖЩШР ЙЭФШР ЪРУРЬ ОПОЙГ ТБЭХР КРИДО ЩРПВС ОТИПО ЪЭУГЬ ДВДШЩ
ВКГХЦ РЩРСД РРЪПЗ БАУВП ВХЖЩВ ЩКАЦЬ ОЪРШВ УПОУВ ЗХЖЩР ШЦРЬЭ ГТГПО КАЩШР УЛБЭЙ ВПРКО БГШЖБ
ГШГС
""",
    """
ЭТЙИР ЮИРЮИ ФИАМВ ЗРЗЫМ ЖХЗНД ФЮЩВП ЙДИРД КГЛТЬ ЗЮЩШК ИМИРВ ДЙЩЙЩ ЮМВИФ ЦВДЕГ ДНЩМЗ ВПЙМИ
НДКРД ЕЮДЙН ЩМПФИ ЛКДФЗ ЬЮЩФЙ ЭИРФЗ ЮЩЪЩЙ ИМПФЗ ДЕЩЧЗ ЫМЖВИ ФЦВДК ЙДРИА ЛЩШМХ ЗЙИРЮ ТВДЪЙ
МЗЫУИ ВЛТЕТ ВГЫЛД ШДЕЮД МЩЫИЭ ДЮИФИ АБФТР ЩЫМЖМ ВЗРЗЫ МЖНДЛ ЗХЗВП ЙЩКЦВ ДДЮЩЮ ИЧИЫЗ ЫНДЫТ
ЦЩВПЯ ВДЭДЙ ЩЮЗЮД ДЕЩЧЗ ЫМЖНД ВДФТЦ ВДЮЩЛ ВДЮИБ ДВИЫН ДЮЖВП ЦВДЙЩ ЮДЮТЧ ЮДЕГЫ ДИФТЮ ИКЫЖВ
ДЭДЦВ ДЕГТВ ДЫЩВП ЧЗЧКТ ЮИЩХЧ ЗКЮДМ ВЩЗЩХ КДЕРД МДЙИМ ВЮДШЫ ЪЕДХЮ ЗВИЫП ЮДМВЩ
""",
    """
ТЖЛТС ХОЮЩМ ЩВСЛД ЖЛТАИ ЖМЪЧЛ ТМКГТ ЙМКХЬ ХДЖЛН МЪЦКХ ЙШЛБЙ ТВЩГЛ ЖВДЖМ КЛДЖГ ЯМКУЬ ГТГТЬ
ГИОВЙ АЩМЪЖ ЛТГВД ЖМКАХ ЛЯГЧГ МЪЖАГ ШЛТМС МЦЛЖЛ ТГКГВ ЭГЪДЦ СМЯЛО РХЙВИ ГОДБХ КМКДЮ ЬХДЖЛ
НВБМС БЛЩЖЛ СМЛРЫ ЮТГКГ ЗЖЛЪМ БХЭБА ЩТАЙБ ЛСЛТК ХЪГФЪ ХЖРЛК УЪЛОВ БМЪМР АКМЦК ВИМЮГ ДШЛТХ
БУГШС ГЗМДЖ ГХБХК МКГШС ГЦЛЖЛ ТКХЪГ ЮБКЮД ЛРЛСЛ ТМЪГЮ ГТБЛО ХРАКМ ДВХЖЪ ЮГЖСХ ТЛЦМЛ ЭГБМЪ
ГЮЛРА ЩЪЛТХ ЪЪАХТ ЖМЩГХ ОГЪВЖ А
""",
    """
АЭЛДИ ЕОХОА ИРИЧО ЕЯЧИТ ФЯТЯШ ЮШСРЖ АОБШЮ ИЧФИД ЗЛХЩО АНЯГЦ СЯФОЩ ЛЫКРИ УИАВЯ СЯИЩЯ ДОБУИ
КОЧИК ИХОСО ХОЭОФ ИГИРИ ЭЖКРО ЪОКТО АЭИСИ ЕОЭДП ЬВЯЫЕ ИШСАЖ СИЧИР ЖЫУЛШ ФРЛШЧ ОЭЭИФ РЯШЖТ
ОТОДЗ ЬЧОЭЧ ИАПХЭ ОАОЧЮ ИФИТИ ЩЛЭЯЯ КРОЪО АЦЧИЧ АЛЙЛР ШОЕФР ЯЛХЩО ТФРИШ ЧЯЧЮШ БШХЭО ЕЛЭЯЧ
ЖЕЛСО ЧЛРЯЭ ЯЭШСЯ ЕАЛТЮ ЕИЩЛЫ КРОЪИ ЕУЛХП ГЯЕАЛ ТЯСИТ ЛФЭОБ ФРЯЛЕ ЭОБСИ ЕЭОЧО УЖТОФ ИТЭО
""",
    """
МЮЖЗЪ ЙВГВЖ СКЛЪМ ЮВОСГ ЩЪДЦО ДСОМЛ ЪЩЪРО ЛЦУЕЯ ГЧЗБЪ АНМЪЩ ЪСЪЗЪ СУЙОЮ ОЛОЖЦ ГЛЖЮА ЪСКЛН
РМНТЖ СЪВВУ ЦОЮСЖ ДЩОЪВ МЖЙОШ ЛОЗЪЩ СЪЛНГ ЮВОБО ШЮКЩО ЩРЪИЛ ЪЮЩЪБ ЖЖЗБЪ ЧВГРГ РЪУЮВ БЖРСЖ
ЛЛНЬЛ ОЛЖДЪ МПДСШ ЦЪМЦЪ ЩВЪБЪ МЦУЬЪ МЛНЬС ГЭГБЪ ЦЮВМЖ ЛЛГЩЪ МЩЛШП КМОЮГ СГЧЗЪ ЬУЦЖМ ТГЧГЗ
ЪАСЖЦ ЛЖМТГ ЧПОФВ ГЦЛГЗ БЪМЪИ ОСДСО МЛЪЩЪ РОЛЦУ ЕЯЖДЪ ГЙВЪВ ЪЛЖЮЩ ЪСКЩЪ БОПВГ ЬЪЗЪМ ВЪБГС
ЖРУ
""",
    """
ЕЖИСИ ВЙСФХ ЩСНИЛ ИМЩНВ КЮОЧФ ИЛНЬБ ЭСЩТЙ ХЙЯТЧ ХСБЩХ ЧИВЙН НЩТШК ХБЩЛЙ НКССУ ТИЛИН ИФКНЩ
НИФКН ЩЛИХЧ НЛККЕ ЙЖЩЬХ ИЛИШЭ ЙЖКЛИ ЮБЩЛЖ УСФХЩ БЩЕИТ ЙВЧСШ ЩЛНЧТ ЛИХЭЛ ИСЖЧМ ЧНЙИН СТШЩХ
ЙНЧЕЖ ЙСУАН ИЕИТЕ ЧГНУМ ЙГЩФЩ МЙИФХ ЬВУСЩ ЬТЭЛЖ КФИМЙ ТЕКФЩ ННУМЙ ФХЩБЩ МЙЕИГ ЧХАЖЧ БВХЙН
НУЯЛИ ЖЙВИЖ НЩБЩВ НЮЮЕИ ХИСЙН КВИМЩ ЛТШЩЖ ГЧЯЛН ЬЗНЧ
""",
    """
АЕФЕЪ ЬГЯЬЫ ЬОГЖГ ВЖТНЫ ЪКЫЬК ЧТЪТЦ ТЛТАТ ИСУЬК ТВНЬФ ТЛКГВ ЖЛТНЭ ЬЖФКК ЛВЕЫЬ ЯЬГТВ ЮЧТНЕ
ЪЖФТФ ТЛБНЩ УКФЩН ЩЙЪЬФ МЩЯСФ ЬВНЩЧ ЬЛОКЕ ФЬФЬО КЦЛИЪ ЩАРЕЯ ЛКИКУ ТЗЧЪК ЭКФСЧ ТРЕХЬ ГКФЬЯ
ЬИВЫЪ СГКВЮ КЯТЧЩ ОЫКГЕ ВЬКЛГ ЕВЩЧТ ЫЬЯЬГ КВЮЪЩ ВВЫКЕ ВНЪЕГ ЫКБНТ РСГЬЪ ТНЬНК УТЦКФ ЬЫТНТ
ЪЬЖТИ ФЬЛГЕ ВЩЩИЕ ЪХЬГЬ ВЮЛЧТ ЪЖИЫЕ КЯЬВЕ ЛЛЫЬФ ЬЛЩЩГ ЕВЬФЕ ТХКИЬ ФФТЬН ЬЫТЛЬ ГЬЙЪЬ ФМЩЯТ
Л
""",
    """
ЧЪВРГ ЪЛАЧЮ БЪВРЧ ЗЮШЛЛ ЖВБЯЪ БРВЫЯ РАЪОА ШЛЮСЯ ЮЛЩХТ РПЪАЧ ЮБРЬЫ ДТХВЛ РЬЪИЦ ШЛРЬЯ ДЭЪЧД
ОЦЛРА ЧЦЬАР МЛРЬЭ ИЮФБР ЙЛЮЫД ФЮОЛЮ ЛДИЯЪ ШЧДОШ ЗЧРСЯ ЮЛЩХТ ЖЛДХА ИДПРИ РВЛЪЧ ЦАШИР ЫЯРАЮ
ОЪРЯХ ФЪДЪИ РЫДФЮ ОЪМРО РГРПЫ ДФЮПЭ ЪЙЯШМ РВАЧЪ ВРГЪЛ ЖВПХИ РЯХЫЪ ОРМЛР УРСЯЮ ЛЩХТЮ ЪИДЯП
ЖЙПТШ ОТЮПР ЯРЧЛЪ БАМЮП ЭДУРА ШРСЪЩ ДЯЮЫД УХКЪД ПРТПЯ ЮЧЪОЪ АЦЫЮЧ ЮОЪРЛ ЖАРЫЯ ЮОЪАЦ ЪСЯЮЛ
ЩХТЖЯ ЮТМДО ЪПЭЪД ЫЖОРЛ ЮМПДЗ ЮАЧЪП РЙАБЮ ОДПРУ РСОЮЛ УЮЛЮВ УЛРПД ЛЪДЫЖ ОЪРЧЧ ДАЛДЛ Ж
""",
    """
УЭЩЭУ ТВОЭА ЦХБЧФ ХДЭНЧ ХЮЭЯЧ ВЧБЕХ ЬЧИЭС НЭЙОЮ ХБЦВЮ ТЧНЧХ ЕДЮНР ЮТЮЛР ЮМЦВЯ ЧУХБЮ ЬНХМЦ
ЛЮУЮМ ЗРЮВЮ МЮТОМ ФМЮХБ ЦДУЮД ФХРЦЬ МЧМЮХ ЭИЬЮБ ХБФДЦ ЫПЧЭУ ЮБОРЮ СЯЦРВ ЭМФДЮ ЯЮКЭН ХЮНЯЦ
БТЩЬН ЭСЮЩЦ ХБУЭМ ЬЧДЮА БЧДУЧ ХНЮВЧ НХЬРВ ЭМФВЦ ХЮНЯЦ БЭИОН ЦХЧВЭ ТЦБЦЬ ШЦИУЧ АВЮСЮ ХФРВЦ
КЧВЭН ЕУЦВЙ ЦЧРЧТ ЭУЦВЭ ИОНЮС ЮНЮТЦ ИОНЦД ЮТЬЩЦ ВЦЧАЭ УЭЩДН ЭАЮИО НЦВЦЯ ЭБЦШУ ЦВЙФЩ ХРЦЬЩ
ЦУЬЯВ ЦЬХФМ РЦЮВТ УФРЦЪ ЯЭУЖЦ НЮШЧЙ ЭУХРФ ЫКДЦС Ф
""",
    """
ИШУБП ШСИЭБ ЩСРНР ШСВЯА ФРНРН ЧУЯАЧ КЯЖРС ВБТФР ШСЭИФ ЭКЯФЭ ЫЭПБЫ СБУЮФ РШСЭС ЧАЭФФ БЭШЖХ
СХИЯУ ФЭКЯУ БЗАБН РФБЖВ ЭЫСФР НРЙЧИ ШСИЯШ СВЯЛЯ ЭКХШУ ЮЙСРБ НРКРН ЧСЧТЭ СЮЭУЭ ТРУЮФ РВЯФЭ
СЮФБЖ ВЭЛРП ЭУЯБК ЧИНРУ РИЧФЯ ЖВРСЭ ИБКЧШ СЯФРИ ЭУРШЮ ИШБИБ ШБУББ ЭИБШБ УБББК ЧДЯМЯ УРШЮЙ
СРЧОБ РЙБФЮ ПЯИФР БПИЯУ ЭФБИЙ БВЯТХ УЯСЯК ЭФЧСЯ ДРНПЯ РФЧИЭ ПБУФБ ЖВЭЫС БУЫЭШ ПБУЯУ ЖБВИХ
ЗИХШС ВБУЭЙ СРДУР ЙРДЖР УЫФЯД РСРВР КРФШС РЫУТХ УБКЧП ЯИФРМ ФЯДРК ХКВРП ШСИБФ ФХККБ ШСРК
""",
    """
ЫЯФЯД ПФУГА ЯДЛНЯ ФТАУЛ УВИЕЛ БЫУПХ УЛБЩМ ЯПФЕМ ПДБОЯ ЛУЧПХ УЫБЧП ЪЛБРЕ ДУВЕЛ ФЯПЬЕ ДЕГЕЫ
НМЩНМ ЕМПФБ ЛЕЫУХ ЕПЪФЯ МЛЕУФ ЯМЧПЛ ЯЯЕЦЕ ВЛБАБ ХЕПЪЫ ЩЫТГМ ЯПФБГ ВБДЯЫ ЕЬЕОБ ДЕЫИБ ЛЕЛБЩ
БПФБХ БПХБЦ ЯЯЛЕФ ДЯПИЕ ФЛЧДТ ОЯЙПВ БЩУУП ЬДБЫБ ПХНЭБ ХБПЪЯ ЮЯАБЮ ЯУЦХУ ОЯИБИ ФЕХЪИ ЕФТЭУ
ЛПЕПЫ ЕУМУЕ ДТЩУЧ МУЕЦЗ ЯВОБЧ УЛБЯВ ОБЧЛБ ДБЛЯЛ НГЫНЭ ЯХУВЬ ЕЩЕРЛ ЧУПЬТ ПФУХП ЧЫЕЫД БРЯРЕ
ЫПФДЯ ФУХЕЛ БАБХЪ ПФЫЕУ БЩЗСФ БЛФНЫ АУПХЯ ИЕФЕД НГЦНХ УУЭФБ ЦЕШУК ЯДУОЯ ДИЕЫЩ ЫБДБВ БЬЕПХ
БЛЛНЙ УЛУДБ ВТЛЯЩ ЕЯГБЫ ЭУЙЩЕ ЦБФБД ЯУФТЭ УЛБ
""",
    """
ЯСГМХ ЩЕГУГ КЩЯЛШ МРЩХР УЧТМТ ММНРЛ ЯЛЭЩЩ ЕГУГР ЛЯЛЭЩ ЕУЩЗЛ АЛХЩШ ЗЛЗЩЗ ЧРЛЩН НЩЩРГ ЭЛЭЩГ
ОЧЧЕУ ГЗЩЩА ЛОГВЛ ХЩШНЧ ЖЩХХЩ ВГОХГ УЛСЕМ УШЬЛЭ СШЩОМ ЭВЛКМ ШСПТМ ЯМУЩН ПЕМНМ ОЧВНМ ЕУЩЗЛ
ЬРМОС ЭМЯГМ ХТМНМ ЯКЙЭС ЛОХГА ХЛШМН ВГТМА ЛЕЭЛЗ ЛНПГБ ЛЭСАЛ РЩХЛС ЯМГЦЛ УНЩЭЭ ГУЩЦС ЗМЦЗЭ
ШВГБМ НШУЛХ ГХЙБЯ ГЭГХМ КЙЭМК УМСЛН ПОХМТ МЩАХЩ БНЛФЩ ЭМСПА ЛЯМЦС ЗЛОЩЩ ЕУМСЩ ЭМСПХ ЛМУЧР
ЩШ
""",
    """
ЕЙЧКЭ ЧЮВЗМ ЩТЦЪЗ ЕЧТЭЩ ЕЧЭПФ ЩБИЦИ ЯВЩТН ИУВЭЖ ТЖРДЧ ЙЗРЧЫ ЗПТНЩ ЙЭИЪС ЧМТЙЗ ШЩБИИ ИЧЕЧД
ИЫЩЭИ СБЦЯЦ ЗБЮЙЩ ЦИБЩТ МЧНЙЦ БЗВТЩ ЕИТАМ ЗФЩЙЩ ЯЕЧТЧ ЭАТНВ ЧИБЗВ ТЩЙЧЯ ЖТСИН ЩЭЧЩД ЧБЩЫЖ
ЭЧБЗУ ЮЩБЧИ ЩДЧБЩ ЫЖЭЧВ ФИТЭЩ ЕЭЩББ ЖРРПШ ЩВТЩД ЧЮЭЦЩ ДЧЙЧЮ БЖРЫЖ ЭЧНЧФ НЧЧТН ЗВЗЭЗ ТАВТЩ
НЗСИБ ЗЮЩШЮ ЗБЗНЧ ФНЧЧБ ЫЖЭЕЧ ЮБЦНШ ИНЩЭЦ МИБЗЕ ЧЭЩТЙ ЗШЩБИ ЦИМЧШ ЩНЫЖН АЭЩШЗ ЭВЖЯЮ ЧЙЗВЭ
ИВЗОХ ИУИЭИ ПМИЙЗ ОХИУД ЮЩБИЫ ПЮАЧЮ ИБТЙЩ ЮИФПШ ИРИБЩ ВТИЭЗ РЮЗНА ЧТЩЫЩ ВЩТНИ
""",
    """
ЧЬВЯЬ НЩНРЖ ВЫБПД ЙНЮПЬ НФЫФЮ ДЪЧЮЩ ЬНШДЗ РБЫЙО ТБФНВ ЫЖЧИФ ОЧНЩП ЮЩНБИ РДПЧН ЮШФЮР ВВПФД
РЖЧЮЕ ПНЗРЮ СЮПБЙ БЩБЩЮ БЗРБЕ ЙВПМФ НВЫЖЧ ШЮЩОХ ШЮЗРЮ БЫСЮП БЙЮФЧ ЮРБПЮ РДЬДЫ ЧЮЙЖЧ ЮЯДЬЭ
БЬШБС БЩБТН ЕНЩБЗ РЮСЮП БЙБШО ПНБЮШ ШОПНЮ ЕЙВПМ ФНЙБЫ ЖЬНЧЬ ВЯЬОБ ЮШФЮР НХБФН ЙБЫЖЮ ШЬДДЮ
ЬНЬДЫ ЩДЙНЫ ЗРНТБ ФНШЖИ НШФЮР ВЙНПФ ДРЖФЮ ИФРНЭ НЙНЫЖ ЧЫДЛД БШЮЫН ПБЙНЫ ЖФЫФЮ ДЧРДЫ ЙЮШЮЛ
РНЙНЫ ЖИНЩЮ ЙБШФД ЬЬБЧШ ЮЫШНЬ ЮФБЙН ЫЖЬНЧ ЮЙДЬН ЗРДПЧ БЮШЮЩ
""",
    """
СЬШБЪ ЭДЕЛБ ЪЛОШО РСФЯЭ РЛЯЛУ ЛОШБЩ ДНСУЛ ОЖПЩЖ ЯЛНШП ЗЪЛБЪ ШЕШЮЭ ЗПЭБЪ ШЕЛЦЛ ЦЕШЧШ ЭЕЛБЪ
ЛООПД БЪЛЪЛ ЦЛЬЪЛ ЩЖЩЖЪ ВЕШНЙ ШЯЛОШ ЮЮЖПК ШКЛЮЛ ЙЭРШЯ ЩЖЯЛХ ЕДРДЯ ДЮШРГ ИЪШЮЪ ЛПКПЛ БКЛОБ
КЛПСЦ ДЮДЕШ ЯЦСЩД ЕЮШЪЛ ЕСОБЯ ДРБЪО ЭДФЪЛ ЦЛЛЮЮ ДПЛЦД УШЪВО РДЕДО ЮИБЛО БДПБД ПДЫБЪ ОЛПШЛ
БЪШОШ ЯБЗХЕ ЭБОЛД ЫЮЛОЛ ЫРЛЯЙ ЮЛБЪЭ ОБДЯД ЪЛОПЛ БКОДР ЛЯЛУЛ ООЖНР ЛЕЛОД ЯЭЕЛБ ЪЛОЛБ ЛЩДЮЮ
ЛБРЕС ЙЭЯБЗ БЮЭПО ФЪЛОЕ ДПЗДЦ ЛОЖНР ЛЕЛОЯ ДЮЭЗ
""",
]
strDecrypt = """

"""
# l_strEncr = [
#     """
# ТДЮКТ ЧЩЭНТ ИКВЮЫ ШЗЬТК ЛМКШК ТКЩМЫ ГКШКТ КЩМЫГ КДЮКР ФМЭКМ КЙКХБ ШНЪЕЦ ШЙЧЩХ РКМБК ШВБЫХ
# ЭЗАЭЦ МЩШЕБ КХБШН ИЫШЫБ ШНЪЕР КМБКШ ВБЫХР ФМШЩР КМЕЛК ИКЧКВ ЮЦТЩВ ЕЭЦБЧ ЦВЫТФ ХЭКМК ЙКХПЩ
# МКТЩБ ВКЯЧЩ ЙЩМЩШ ШФЭЫЫ ВЗУЫЭ ЫПЩЧЮ ЦЭЫТВ ЩТЩИК ОЫИЗЧ ЩШЦПЫ ШЦНКЮ ЗВЮЦМ КИКВБ ЗПЦЬЖ ЩИКТЪ
# ИМНЙЦ ЙКЮЫУ КИКЭЩ ЧШКИК ЛЦИЦЯ ЧЩЙВЮ ЦТМНМ КВЦЭЗ ЬЧЩЪБ ЗЬЯЧК ЮЫТКЯ КМКАШ КВЮЕВ ЩИКЭЦ МЩШЕБ
# КЬКАЫ ТМЩШШ КЬАЩШ КХ
# """
# ]


l_key = [
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ц Р Т И Й Щ А Ъ Ы Х Б М Э Ш К Я Ч В Ю З О У Г П Л Ж С Ф Е Д Ь Н
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ъ Т Я Ь Ж Ф Ю З О В Э У А П Г Д Ч К Б Л Н М Ы Щ Р И Е Й Ц Х С Ш
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ц К У Ж Е Т В П Э Й Ъ М И Ю Х Ф Н Б С Щ Ь Ы А О Я Л Ч З Р Д Г Ш
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
М И Б Й Я В П О Т Е У К Ч Х Д Э Ш С Н Г Ы Ф Ъ Ц Ь А З Ж Л Р Щ Ю
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
А С Х Р Ы Г Ж Ц Н Л Е Ш Ю Т В Щ М О П З Й Д Ч И Я Б Ф У Э Ь К Ъ
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Х З В А М Ъ К И С Й О Б У Ж Э Ч Ы Ю Н Ф Г Ц Р Я Д Ь Т Л Е Ш П Щ
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Я Д А М Т Ь Р Н Ъ Щ Ф Ц Ю И Л К Х Г Й С Ш О З П В Ч Ж Ы Э Е Б У
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Й Д С З Ф М Ь П Е Ч Щ У Ъ Г Ы Ж Я А Б Ш Н Р И К Л В Э Х Ц О Т Ю
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ч Ш Л Э Х В Т Ф А М К З Я Ъ У Н Ц Ж И О Ю Г С Й Б Е Д Щ Ь Р П Ы
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Я Ж М Н И С Г Т Ю У Ь Х Л Ч Б Ш Ц О Д Е Й Ъ А Р Ы Щ З Э Ф П К В
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ь М Г Ю Ш Ф Л А Ж Е С О Д К Ц Ы Р З Э Н Й Щ И У В Я Х П Т Ъ Ч Б
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Э Р Й Ы З И Д М А Ш Ъ К Ц О Щ Х П В Н Л Ч Ж Ь Г У Я Е Ю Б Ф Т С
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
У Ь С З Ы В Н Ч Ж Л М Т И Х Д Б Ю Г Ш Э Й Я Щ О П Ц Ъ Е А К Р Ф
       """,
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Д Ф В З Ч Р Ж Я П А О Л Ъ Ь Щ И Г Б К С М Ю Ы Х Ц Й Н Е Э Ш У Т
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
К О Т Ъ С Е Ж М Ф Й У Н Ц А Х Д Я Э Ю Щ И Ш Ь Г В Р Б Л Ч З П Ы
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Й Н Т К И Ъ Л О П Ь Р Ш Ц З Я Ф С Г Х Щ Ж Э В Ч Ю Б Е А М Ы У Д
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Т У И П Ъ Ь В Р Л Б Н Ч О К Я Ю Ф М Х Г Е З А Ж Ц Ш Щ Ы Д С Й Э
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Й У Р Ф К Э Щ С М Ч Г Б Ж Ъ Я И Х Ш А Ы Н Е Т Ю Ь О В П Ц Д Л З
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
В К У Ъ Б Г Т Л О С Щ П Й Д Р Ц Ь Х Ш Э М Ы Ч Ф Н Е Ю А Ж Я И З
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
З Е Й Э К И Ч Х Щ Ш Л Ы Ф Ю Д Н Р М В Т У Б А Ц Ь С О Г П Я Ъ Ж
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
М Р Т Ц Б Х Э Й Г Н Щ К О Ъ Л Ш С Д Ж В Я И Ч З Ь П Ы А У Е Ф Ю
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
О У А К Д Л Щ Х Я Ы С Т Е Э И Ф Р Ш Ч П Ъ Г М Й Н В З Ж Ю Ц Ь Б
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
О А М Д Ц Ж И П Г Ч Щ С Р Л Ъ З Б Ю В У Ы Ь Э Й Т Я Х Н К Ф Е Ш
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Щ Р С Ф В Ч З Б Й Я Л Х М Н И Е Ж Т Ш К Ы Ц Ъ А Г О П У Э Д Ю Ь
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ь Р Л А И Е Х Я К З Ы Г У Ф Т Ч Ъ В Н Щ Й Ц М Э О Ш Д С Ю Б П Ж
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ю Ы П У М Д Ф Т Ъ Й Б О В Л Р И Я А Ч Х С Г Щ З Э К Н Ж Ц Е Ь Ш
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ц И Т С Я Э Ж Щ Ч Л Р Н М В Ю Д У Х Б Ф Ш Ъ Й А К П Г О Е З Ы Ь
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Я Т И Н П Б О М Э З Д У К Ф Р Ж В Ш С Ч Ь Л Ц Й А Г Е Х Ю Щ Ъ Ы
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Б Ц Ы Р Щ Я О В У Й И Х М Л Е Ь Д П Ф Т Ш Г К А Э Ю З Н Ъ Ж С Ч
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Л К Я Т Р Г Ь А Щ Ц З Э О Х М Е У С Н Ч Ъ Б Д В Ж Ф Ю Й П Ы И Ш
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
З Ы В Д Ю Щ Ш Я И У С Э М Б Ч Е Й Т Н П Ь Р Ъ Ф К Х Л Ж А Г О Ц
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Н Л Ф Е П Д Я И Б Ъ Ч Й Щ Ь Ю З Р Ы Ш О Ц С К Х Т Э А М Ж У Г В
""",
    """
А Б В Г Д Е Ж З И Й К Л М Н О П Р С Т У Ф Х Ц Ч Ш Щ Ъ Ы Ь Э Ю Я
Ш Щ О Ц Р Д Й Н Э Ы К Я П Ю Л Х Е Б Ъ С Ч У Т Ь А М Г Ж В Ф И З
""",
]

# print(len(l_key), len(l_strEncr))


def process(key, strEncr):
    strEncr = strEncr.replace(" ", "").replace("\n", "")
    lst_str = key.strip().replace("\n", " ").split(" ")
    lst1 = lst_str[0 : int(len(lst_str) / 2)]
    lst2 = lst_str[int(len(lst_str) / 2) :]
    dict_decript = dict(zip(lst2, lst1))
    for elem in strEncr:
        print(dict_decript[elem], end=",")
    print()
    with open("tableNguonTheoThuTu.txt", "a", encoding="utf-8") as f:
        f.write("luotmoi\n")
        for elem in strEncr:
            f.write(dict_decript[elem])


for i in range(len(l_key)):
    if i == 1:
        break
    process(l_key[i], l_strEncr[i])
    # strEncr = l_strEncr[i].replace(" ", "").replace("\n", "")
    # print(len(strEncr), end="  ")
    # print(l_strEncr)
# for elem in [
#     6,
#     22,
#     28,
#     10,
#     20,
#     29,
#     3,
#     14,
#     24,
#     4,
#     1,
#     16,
#     7,
#     5,
#     17,
#     13,
#     27,
#     30,
#     15,
#     18,
#     0,
#     2,
#     11,
#     12,
#     19,
#     8,
#     25,
#     9,
#     31,
#     21,
#     23,
#     26,
# ]:
#     print(ord(dict_decript[chr(elem + ord("А"))]) - ord("А"), end=",")

# [8, 0, 14, 5, 13, 18, 2, 4, 11, 12, 16, 31, 17, 9, 10, 3, 15, 19, 27, 28, 1, 6, 7, 23, 24, 21, 22, 20, 25, 26, 29, 30]
# strDecrypt = strDecrypt.replace("\n", "").replace(" ", "")
# arrTS_enc = [0] * 32
# ord_A = ord("А")
# for elem in strDecrypt:
#     arrTS_enc[ord(elem) - ord_A] += 1
# for i in range(26, 31):
#     arrTS_enc[i] = arrTS_enc[i + 1]
# arrTS_enc.pop(-1)
# tu_dien_enc = {i: arrTS_enc[i] for i in range(len(arrTS_enc))}
# # print(tu_dien)
# danh_sach_key_enc = sorted(tu_dien_enc, key=tu_dien_enc.get, reverse=True)
# print(danh_sach_key_enc)
