# strDecrypt = """
# ГРАФИНЯБЫЛАЖЕНЩИНАСВОСТОЧНЫМТИПОМТИПОМДУДОГОЛИЦАЛЕТСОРОКАПЯТИВИДИМОИЗНУРЕННАЯДЕТЬМИКОТОРЫХУНЕЙБЫЛОДВЕНАДЦАТЬЧЕЛОВЕКМЕДЛИТЕЛЬНОСТЬЕЕДВИЖЕНИЙИГОВОРАПРОИСХОДИВШАЯОТСЛАБОСТИТИЛПРИДАВАЛАЕЙЗНЯЧИТЕЛЬНЫЙВИДВНУШАВШИЙУВАЖЕНИЕКНЯГИНЯАННАМИХАЙЛОВНАДРУБЕЦКАЯКАКДОМАШНИЙЧЕЛОВЕКСИДЕЛАТУТЖЕПОМОГАЯВДЕЛЕПРИНИМАНИЯИЗАНИМАНИЯРАЗГОВОРОМГОСТЕЙ
# """
# str_template = "ГРАФИНЯБЫЛАЖЕНЩИНАСВОСТОЧНЫМТИПОМТИПОМДУДОГОЛИЦАЛЕТСОРОКАПЯТИВИДИМОИЗНУРЕННАЯДЕТЬМИКОТОРЫХУНЕЙБЫЛОДВЕНАДЦАТЬЧЕЛОВЕКМЕДЛИТЕЛЬНОСТЬЕЕДВИЖЕНИЙИГОВОРАПРОИСХОДИВШАЯОТСЛАБОСТИТИЛПРИДАВАЛАЕЙЗНЯЧИТЕЛЬНЫЙВИДВНУШАВШИЙУВАЖЕНИЕКНЯГИНЯАННАМИХАЙЛОВНАДРУБЕЦКАЯКАКДОМАШНИЙЧЕЛОВЕКСИДЕЛАТУТЖЕПОМОГАЯВДЕЛЕПРИНИМАНИЯИЗАНИМАНИЯРАЗГОВОРОМГОСТЕЙ"

str_template = """
ВЭТОВРЕМЯВГОСТИНУЮВОШЛОНОВОЕЛИЦОНОВОЕЛИЦОЭТОБЫЛМОЛОДОЙКНЯЗЬАНДРЕЙБОЛКОНСКИЙМУЖМАЛЕНЬКОЙКНЯГИНИКНЯЗЬБОЛКОНСКИЙБЫЛНЕБОЛЬШОГОРОСТАВЕСЬМАКРАСИВЫЙМОЛОДОЙЧЕЛОВЕКСОПРЕДЕЛЕННЫМИИСУХИМИЧЕРТАМИВСЕВЕГОФИГУРЕНАЧИНАЯОТУСТАЛОГОСКУЧАЮЩЕГОВЗГЛЯДАДОТИХОГОМЕРНОГОШАГАПРЕДСТАВЛЯЛОСАМУЮРЕЗКУЮПРОТИВОПОЛОЖНОСТЬСЕГОМАЛЕНЬКОЮОЖИВЛЕННОЮЖЕНОЙЕМУВИДИМОВСЕБЫВШИЕВГОСТИНОЙНЕТОЛЬКОБЫЛИЗНАКОМЫНОУЖНАДОЕЛИЕМУТАКЧТОИСМОТРЕТЬНАНИХИСЛУШАТЬИХЕМУБЫЛООЧЕНЬСКУЧНОИЗВСЕХЖЕПРИСКУЧИВШИХЕМУЛИЦЛИЦОЕГОХОРОШЕНЬКОЙЖЕНЫКАЗАЛОСЬБОЛЬШЕВСЕХЕМУНАДОЕЛОСГРИМАСОЙПОРТИВШЕЮЕГОКРАСИВОЕЛИЦООНОТВЕРНУЛСЯОТНЕЕОНПОЦЕЛОВАЛРУКУАННЫПАВЛОВНЫИЩУРЯСЬОГЛЯДЕЛВСЕОБЩЕСТВОНОВЛИЯНИЕВСВЕТЕЕСТЬКАПИТАЛКОТОРЫЙНАДОБЕРЕЧЬЧТОБОННЕИСЧЕЗКНЯЗЬВАСИЛИЙЗНАЛЭТОИРАЗСООБРАЗИВЧТОЕЖЕЛИБЫОНСТАЛПРОСИТЬЗАВСЕХКТОЕГОПРОСИТТОВСКОРЕЕМУНЕЛЬЗЯБЫЛОБЫПРОСИТЬЗАСЕБЯОНРЕДКОУПОТРЕБЛЯЛСВОЕВЛИЯНИЕВДЕЛЕКНЯГИНИДРУБЕЦКОЙОНПОЧУВСТВОВАЛОДНАКОПОСЛЕЕЕНОВОГОПРИЗЫВАЧТОТОВРОДЕУКОРАСОВЕСТИОНАНАПОМНИЛАЕМУПРАВДУПЕРВЫМИШАГАМИСВОИМИВСЛУЖБЕОНБЫЛОБЯЗАНЕЕОТЦУКРОМЕТОГООНВИДЕЛПОЕЕПРИЕМАМЧТООНАОДНАИЗТЕХЖЕНЩИНОСОБЕННОМАТЕРЕЙКОТОРЫЕОДНАЖДЫВЗЯВСЕБЕЧТОНИБУДЬВГОЛОВУНЕОТСТАНУТДОТЕХПОРПОКАНЕИСПОЛНЯТИХЖЕЛАНИЯАВПРОТИВНОМСЛУЧАЕГОТОВЫНАЕЖЕДНЕВНЫЕЕЖЕМИНУТНЫЕПРИСТАВАНИЯИДАЖЕНАСЦЕНЫЭТОПОСЛЕДНЕЕСООБРАЖЕНИЕПОКОЛЕБАЛОЕГОПЬЕРБЫЛНЕУКЛЮЖТОЛСТЫЙВЫШЕОБЫКНОВЕННОГОРОСТАШИРОКИЙСОГРОМНЫМИКРАСНЫМИРУКАМИОНКАКГОВОРИТСЯНЕУМЕЛВОЙТИВСАЛОНИЕЩЕМЕНЕЕУМЕЛИЗНЕГОВЫЙТИТОЕСТЬПЕРЕДВЫХОДОМСКАЗАТЬЧТОНИБУДЬОСОБЕННОПРИЯТНОЕКРОМЕТОГООНБЫЛРАССЕЯНВСТАВАЯОНВМЕСТОСВОЕЙШЛЯПЫЗАХВАТИЛТРЕХУГОЛЬНУЮШЛЯПУСГЕНЕРАЛЬСКИМПЛЮМАЖЕМИДЕРЖАЛЕЕДЕРГАЯСУЛТАНДОТЕХПОРПОКАГЕНЕРАЛНЕПОПРОСИЛВОЗВРАТИТЬЕЕУЖЕБЫЛВТОРОЙЧАСНОЧИКОГДАПЬЕРВЫШЕЛТСВОЕГОДРУГАНОЧЬБЫЛАИЮНЬСКАЯПЕТЕРБУРГСКАЯБЕССУМРАЧНАЯНОЧЬПЬЕРСЕЛВИЗВОЗЧИЧЬЮКОЛЯСКУСНАМЕРЕНИЕМЕХАТЬДОМОЙНОЧЕМБЛИЖЕОНПОДЪЕЗЖАЛТЕМБОЛЕЕОНЧУВСТВОВАЛНЕВОЗМОЖНОСТЬЗАСНУТЬВЭТУНОЧЬПОХОДИВШУЮБОЛЕЕНАВЕЧЕРИЛИНАУТРОДАЛЕКОБЫЛОВИДНОПОПУСТЫМУЛИЦАМПОДЪЕХАВККРЫЛЬЦУБОЛЬШОГОДОМАУКОННОГВАРДЕЙСКИХКАЗАРМВКОТОРЫХЖИЛАНАТОЛЬОНПОДНЯЛСЯНАОСВЕЩЕННОЕКРЫЛЬЦОНАЛЕСТНИЦУИВОШЕЛВОТВОРЕННУЮДВЕРЬВПЕРЕДНЕЙНИКОГОНЕБЫЛОВАЛЯЛИСЬПУСТЫЕБУТЫЛКИПЛАЩИКАЛОШИПАХЛОВИНОМСЛЫШАЛСЯДАЛЬНИЙГОВОРИКРИКИГРАИУЖИНУЖЕКОНЧИЛИСЬНОГОСТИЕЩЕНЕРАЗЪЕЗЖАЛИСЬПЬЕРСКИНУЛПЛАЩИВОШЕЛВПЕРВУЮКОМНАТУГДЕСТОЯЛИОСТАТКИУЖИНАИОДИНЛАКЕЙДУМАЯЧТОЕГОНИКТОНЕВИДИТДОПИВАЛТАЙКОМНЕДОПИТЫЕСТАКАНЫКНЯЗЬВАСИЛИЙИСПОЛНИЛОБЕЩАНИЕДАННОЕНАВЕЧЕРЕУАННЫПАВЛОВНЫКНЯГИНЕДРУБЕЦКОЙПРОСИВШЕЙЕГООСВОЕМЕДИНСТВЕННОМСЫНЕБОРИСЕОНЕМБЫЛОДОЛОЖЕНОГОСУДАРЮИНЕВПРИМЕРДРУГИМОНБЫЛПЕРЕВЕДЕНВГВАРДИЮСЕМЕНОВСКОГОПОЛКАПРАПОРЩИКОМНОАДЪЮТАНТОМИЛИСОСТОЯЩИМПРИКУТУЗОВЕБОРИСТАКИНЕБЫЛНАЗНАЧЕННЕСМОТРЯНАВСЕХЛОПОТЫИПРОИСКИАННЫМИХАЙЛОВНЫВСКОРЕПОСЛЕВЕЧЕРААННЫПАВЛОВНЫАННАМИХАЙЛОВНАВЕРНУЛАСЬВМОСКВУПРЯМОКСВОИМБОГАТЫМРОДСТВЕННИКАМРОСТОВЫМУКОТОРЫХОНАСТОЯЛАВМОСКВЕИУКОТОРЫХСДЕТСТВАВОСПИТЫВАЛСЯИГОДАМИЖИВАЛЕЕОБОЖАЕМЫЙБОРЕНЬКАТОЛЬКОЧТОПРОИЗВЕДЕННЫЙВАРМЕЙСКИЕИТОТЧАСЖЕПЕРЕВЕДЕННЫЙВГВАРДЕЙСКИЕПРАПОРЩИКИГВАРДИЯУЖЕВЫШЛАИЗПЕТЕРБУРГАГОАВГУСТАИСЫНОСТАВШИЙСЯДЛЯОБМУНДИРОВАНИЯВМОСКВЕДОЛЖЕНБЫЛДОГНАТЬЕЕПОДОРОГЕВРАДЗИВИЛОВУРОСТОВЫХБЫЛИИМЕНИННИЦЫНАТАЛЬИМАТЬИМЕНЬШАЯДОЧЬСУТРАНЕПЕРЕСТАВАЯПОДЪЕЗЖАЛИИОТЪЕЗЖАЛИЦУГИПОДВОЗИВШИЕПОЗДРАВИТЕЛЕЙКБОЛЬШОМУВСЕЙМОСКВЕИЗВЕСТНОМУДОМУГРАФИНИРОСТОВОЙНАПОВАРСКОЙГРАФИНЯСКРАСИВОЙСТАРШЕЮДОЧЕРЬЮИГОСТЯМИНЕПЕРЕСТАВАВШИМИСМЕНЯТЬОДИНДРУГОГОСИДЕЛИВГОСТИНОЙГРАФИНЯБЫЛАЖЕНЩИНАСВОСТОЧНЫМТИПОМХУДОГОЛИЦАЛЕТСОРОКАПЯТИВИДИМОИЗНУРЕННАЯДЕТЬМИКОТОРЫХУНЕЙБЫЛОДВЕНАДЦАТЬЧЕЛОВЕКМЕДЛИТЕЛЬНОСТЬЕЕДВИЖЕНИЙИГОВОРАПРОИСХОДИВШАЯОТСЛАБОСТИСИЛПРИДАВАЛАЕЙЗНАЧИТЕЛЬНЫЙВИДВНУШАВШИЙУВАЖЕНИЕКНЯГИНЯАННАМИХАЙЛОВНАДРУБЕЦКАЯКАКДОМАШНИЙЧЕЛОВЕКСИДЕЛАТУТЖЕПОМОГАЯВДЕЛЕПРИНИМАНИЯИЗАНИМАНИЯРАЗГОВОРОМГОСТЕЙДВАМОЛОДЫЕЧЕЛОВЕКАСТУДЕНТИОФИЦЕРДРУЗЬЯСДЕТСТВАБЫЛИОДНИХЛЕТИОБАКРАСИВЫНОНЕПОХОЖИДРУГНАДРУГАБОРИСБЫЛВЫСОКИЙБЕЛОКУРЫЙЮНОШАСПРАВИЛЬНЫМИТОНКИМИЧЕРТАМИСПОКОЙНОГОИКРАСИВОГОЛИЦАНИКОЛАЙБЫЛНЕВЫСОКИЙКУРЧАВЫЙМОЛОДОЙЧЕЛОВЕКСОТКРЫТЫМВЫРАЖЕНИЕМЛИЦАНАВЕРХНЕЙГУБЕЕГОУЖЕПОКАЗЫВАЛИСЬЧЕРНЫЕВОЛОСИКИИВОВСЕМЛИЦЕВЫРАЖАЛИСЬСТРЕМИТЕЛЬНОСТЬИВОСТОРЖЕННОСТЬКОГДАНАТАШАВЫШЛАИЗГОСТИНОЙИПОБЕЖАЛАОНАДОБЕЖАЛАТОЛЬКОДОЦВЕТОЧНОЙВЭТОЙКОМНАТЕОНАОСТАНОВИЛАСЬПРИСЛУШИВАЯСЬКГОВОРУВГОСТИНОЙИОЖИДАЯВЫХОДАБОРИСАОНАУЖЕНАЧИНАЛАПРИХОДИТЬВНЕТЕРПЕНИЕИТОПНУВНОЖКОЙСБИРАЛАСЬБЫЛОЗАПЛАКАТЬОТТОГОЧТООННЕСЕЙЧАСШЕЛКОГДАЗАСЛЫШАЛИСЬНЕТИХИЕНЕБЫСТРЫЕПРИЛИЧНЫЕШАГИМОЛОДОГОЧЕЛОВЕКАБОРИСОСТАНОВИЛСЯПОСЕРЕДИКОМНАТЫОГЛЯНУЛСЯСМАХНУЛРУКОЙСОРИНКИСРУКАВАМУНДИРАИПОДОШЕЛКЗЕРКАЛУРАССМАТРИВАЯСВОЕКРАСИВОЕЛИЦОНАТАШАПРИТИХНУВВЫГЛЯДЫВАЛАИЗСВОЕЙЗАСАДЫОЖИДАЯЧТООНБУДЕТДЕЛАТЬОНПОСТОЯЛНЕСКОЛЬКОВРЕМЕНИПЕРЕДЗЕРКАЛОМУЛЫБНУЛСЯИПОШЕЛКВЫХОДНОЙДВЕРИНАТАШАХОТЕЛАЕГООКЛИКНУТЬНОПОТОМРАЗДУМАЛАТОЛЬКОЧТОБОРИСВЫШЕЛКАКИЗДРУГОЙДВЕРИВЫШЛАРАСКРАСНЕВШАЯСЯСОНЯСКВОЗЬСЛЕЗЫЧТОТОЗЛОБНОШЕПЧУЩАЯНАТАШАУДЕРЖАЛАСЬОТСВОЕГОПЕРВОГОДВИЖЕНИЯВЫБЕЖАТЬКНЕЙИОСТАЛАСЬВСВОЕЙЗАСАДЕКАКПОДШАПКОЙНЕВИДИМКОЙВЫСМАТРИВАЯЧТОДЕЛАЛОСЬНАСВЕТЕОНАИСПЫТЫВАЛАОСОБОЕНОВОЕНАСЛАЖДЕНИЕСОНЯШЕПТАЛАЧТОТОИОГЛЯДЫВАЛАСЬНАДВЕРЬГОСТИНОЙИЗДВЕРИВЫШЕЛНИКОЛАЙГРАФИНЯТАКУСТАЛАОТВИЗИТОВЧТОНЕВЕЛЕЛАПРИНИМАТЬБОЛЬШЕНИКОГОИШВЕЙЦАРУПРИКАЗАНОБЫЛОТОЛЬКОЗВАТЬНЕПРЕМЕННОКУШАТЬВСЕХКТОБУДЕТЕЩЕПРИЕЗЖАТЬСПОЗДРАВЛЕНИЯМИГРАФИНЕХОТЕЛОСЬСГЛАЗУНАГЛАЗПОГОВОРИТЬСДРУГОМСВОЕГОДЕТСТВАКНЯГИНЕЙАННОЙМИХАЙЛОВНОЙКОТОРУЮОНАНЕВИДАЛАХОРОШЕНЬКОСЕЕПРИЕЗДАИЗПЕТЕРБУРГААННАМИХАЙЛОВНАССВОИМИСПЛАКАННЫМИПРИЯТНЫМЛИЦОМПОДВИНУЛАСЬБЛИЖЕККРЕСЛУГРАФИНИПЬЕРТАКИНЕУСПЕЛВЫБРАТЬСЕБЕКАРЬЕРЫВПЕТЕРБУРГЕИДЕЙСТВИТЕЛЬНОБЫЛВЫСЛАНВМОСКВУЗАБУЙСТВОИСТОРИЯКОТОРУЮРАССКАЗЫВАЛИУГРАФАРОСТОВАБЫЛАСПРАВЕДЛИВАПЬЕРУЧАСТВОВАЛВСВЯЗЫВАНЬИКВАРТАЛЬНОГОСМЕДВЕДЕМОНПРИЕХАЛНЕСКОЛЬКОДНЕЙТОМУНАЗАДИОСТАНОВИЛСЯКАКВСЕГДАВДОМЕСВОЕГООТЦАХОТЯОНИПРЕДПОЛАГАЛЧТОИСТОРИЯЕГОУЖЕИЗВЕСТНАВМОСКВЕИЧТОДАМЫОКРУЖАЮЩИЕЕГООТЦАВСЕГДАНЕДОБРОЖЕЛАТЕЛЬНЫЕКНЕМУВОСПОЛЬЗУЮТСЯЭТИМСЛУЧАЕМЧТОБЫРАЗДРАЖИТЬГРАФАОНВСЕТАКИВДЕНЬПРИЕЗДАПОШЕЛНАПОЛОВИНУОТЦАВОЙДЯВГОСТИНУЮОБЫЧНОЕМЕСТОПРЕБЫВАНИЕКНЯЖЕНОНПОЗДОРОВАЛСЯСДАМАМИСИДЕВШИМИЗАПЯЛЬЦАМИИЗАКНИГОЙКОТОРУЮВСЛУХЧИТАЛАОДНАИЗНИХИХБЫЛОТРИНИКОЛАЙСИДЕЛДАЛЕКООТСОНИПОДЛЕЖЮЛИКАРАГИНОЙИОПЯТЬСТОЙЖЕНЕВОЛЬНОЙУЛЫБКОЙЧТОТОГОВОРИЛСНЕЙСОНЯУЛЫБАЛАСЬПАРАДНОНОВИДИМОМУЧИЛАСЬРЕВНОСТЬЮТОБЛЕДНЕЛАТОКРАСНЕЛАИВСЕМИСИЛАМИПРИСЛУШИВАЛАСЬКТОМУЧТОГОВОРИЛИМЕЖДУСОБОЮНИКОЛАЙИЖЮЛИГУВЕРНАНТКАБЕСПОКОЙНООГЛЯДЫВАЛАСЬКАКБЫПРИГОТАВЛИВАЯСЬКОТПОРУЕЖЕЛИБЫКТОВЗДУМАЛОБИДЕТЬДЕТЕЙГУВЕРНЕРНЕМЕЦСТАРАЛСЯЗАПОМНИТЬВОЕРОДЫКУШАНИЙДЕСЕРТОВИВИНСТЕМЧТОБЫОПИСАТЬВСЕПОДРОБНОВПИСЬМЕКДОМАШНИМВГЕРМАНИЮИВЕСЬМАОБИЖАЛСЯТЕМЧТОДВОРЕЦКИЙСЗАВЕРНУТОЮВСАЛФЕТКУБУТЫЛКОЙОБНОСИЛЕГОНЕМЕЦХМУРИЛСЯСТАРАЛСЯПОКАЗАТЬВИДЧТООНИНЕЖЕЛАЛПОЛУЧИТЬЭТОГОВИНАНООБИЖАЛСЯПОТОМУЧТОНИКТОНЕХОТЕЛПОНЯТЬЧТОВИНОНУЖНОБЫЛОЕМУНЕДЛЯТОГОЧТОБЫУТОЛИТЬЖАЖДУНЕИЗЖАДНОСТИАИЗДОБРОСОВЕСТНОЙЛЮБОЗНАТЕЛЬНОСТИВТОВРЕМЯКАКУРОСТОВЫХТАНЦОВАЛИВЗАЛЕШЕСТОЙАНГЛЕЗПОДЗВУКИОТУСТАЛОСТИФАЛЬШИВИВШИХМУЗЫКАНТОВИУСТАЛЫЕОФИЦИАНТЫИПОВАРАГОТОВИЛИУЖИНСГРАФОМБЕЗУХИМСДЕЛАЛСЯШЕСТОЙУДАРДОКТОРАОБЪЯВИЛИЧТОНАДЕЖДЫКВЫЗДОРОВЛЕНИЮНЕТБОЛЬНОМУДАНАБЫЛАГЛУХАЯИСПОВЕДЬИПРИЧАСТИЕДЕЛАЛИПРИГОТОВЛЕНИЯДЛЯСОБОРОВАНИЯИВДОМЕБЫЛАСУЕТНЯИТРЕВОГАОЖИДАНИЯОБЫКНОВЕННЫЕВТАКИЕМИНУТЫВНЕДОМАЗАВОРОТАМИТОЛПИЛИСЬСКРЫВАЯСЬОТПОДЪЕЗЖАВШИХЭКИПАЖЕЙГРОБОВЩИКИОЖИДАЯБОГАТОГОЗАКАЗАНАПОХОРОНЫГРАФАГЛАВНОКОМАНДУЮЩИЙМОСКВЫКОТОРЫЙБЕСПРЕСТАННОПРИСЫЛАЛАДЪЮТАНТОВУЗНАВАТЬОПОЛОЖЕНИИГРАФАВЭТОТВЕЧЕРСАМПРИЕЗЖАЛПРОСТИТЬСЯСЗНАМЕНИТЫМЕКАТЕРИНИНСКИМВЕЛЬМОЖЕЙГРАФОМБЕЗУХИМВЕЛИКОЛЕПНАЯПРИЕМНАЯКОМНАТАБЫЛАПОЛНАВСЕПОЧТИТЕЛЬНОВСТАЛИКОГДАГЛАВНОКОМАНДУЮЩИЙПРОБЫВОКОЛОПОЛУЧАСАНАЕДИНЕСБОЛЬНЫМВЫШЕЛОТТУДАСЛЕГКАОТВЕЧАЯНАПОКЛОНЫИСТАРАЯСЬКАКМОЖНОСКОРЕЕПРОЙТИМИМОУСТРЕМЛЕННЫХНАНЕГОВЗГЛЯДОВДОКТОРОВДУХОВНЫХЛИЦИРОДСТВЕННИКОВКНЯЗЬВАСИЛИЙПОХУДЕВШИЙИПОБЛЕДНЕВШИЙЗАЭТИДНИПРОВОЖАЛГЛАВНОКОМАНДУЮЩЕГОИЧТОТОНЕСКОЛЬКОРАЗТИХОПОВТОРИЛЕМУПРОВОДИВГЛАВНОКОМАНДУЮЩЕГОКНЯЗЬВАСИЛИЙСЕЛВЗАЛЕОДИННАСТУЛЗАКИНУВВЫСОКОНОГУНАНОГУНАКОЛЕНКУУПИРАЯЛОКОТЬИРУКОЮЗАКРЫВГЛАЗАПОСИДЕВТАКНЕСКОЛЬКОВРЕМЕНИОНВСТАЛИНЕПРИВЫЧНОПОСПЕШНЫМИШАГАМИОГЛЯДЫВАЯСЬКРУГОМИСПУГАННЫМИГЛАЗАМИПОШЕЛЧРЕЗДЛИННЫЙКОРИДОРНАЗАДНЮЮПОЛОВИНУДОМАКСТАРШЕЙКНЯЖНЕГЕНЕРАЛЗАКАШЛЯЛСЯОТКРИКАИПОРОХОВОГОДЫМАИОСТАНОВИЛСЯВОТЧАЯНИИВСЕКАЗАЛОСЬПОТЕРЯНОНОВЭТУМИНУТУФРАНЦУЗЫНАСТУПАВШИЕНАНАШИХВДРУГБЕЗВИДИМОЙПРИЧИНЫПОБЕЖАЛИНАЗАДСКРЫЛИСЬИЗОПУШКИЛЕСАИВЛЕСУПОКАЗАЛИСЬРУССКИЕСТРЕЛКИЭТОБЫЛАРОТАТИМОХИНАКОТОРАЯОДНАВЛЕСУУДЕРЖАЛАСЬВПОРЯДКЕИЗАСЕВВКАНАВУУЛЕСАНЕОЖИДАННОАТАКОВАЛАФРАНЦУЗОВТИМОХИНСТАКИМОТЧАЯННЫМКРИКОМБРОСИЛСЯНАФРАНЦУЗОВИСТАКОЮБЕЗУМНОЮИПЬЯНОЮРЕШИТЕЛЬНОСТЬЮСОДНОЮШПАЖКОЙНАБЕЖАЛНАНЕПРИЯТЕЛЯЧТОФРАНЦУЗЫНЕУСПЕВОПОМНИТЬСЯПОБРОСАЛИОРУЖИЕИПОБЕЖАЛИДОЛОХОВБЕЖАВШИЙРЯДОМСТИМОХИНЫМВУПОРУБИЛОДНОГОФРАНЦУЗАИПЕРВЫЙВЗЯЛЗАВОРОТНИКСДАВШЕГОСЯОФИЦЕРАБЕГУЩИЕВОЗВРАТИЛИСЬБАТАЛИОНЫСОБРАЛИСЬИФРАНЦУЗЫРАЗДЕЛИВШИЕБЫЛОНАДВЕЧАСТИВОЙСКАЛЕВОГОФЛАНГАНАМГНОВЕНИЕБЫЛИОТТЕСНЕНЫРЕЗЕРВНЫЕЧАСТИУСПЕЛИСОЕДИНИТЬСЯИБЕГЛЕЦЫОСТАНОВИЛИСЬПОЛКОВОЙКОМАНДИРСТОЯЛСМАЙОРОМЭКОНОМОВЫМУМОСТАПРОПУСКАЯМИМОСЕБЯОТСТУПАЮЩИЕРОТЫКОГДАКНЕМУПОДОШЕЛСОЛДАТВЗЯЛЕГОЗАСТРЕМЯИПОЧТИПРИСЛОНИЛСЯКНЕМУНАСОЛДАТЕБЫЛАСИНЕВАТАЯФАБРИЧНОГОСУКНАШИНЕЛЬРАНЦАИКИВЕРАНЕБЫЛОГОЛОВАБЫЛАПОВЯЗАНАИЧЕРЕЗПЛЕЧОБЫЛАНАДЕТАФРАНЦУЗСКАЯЗАРЯДНАЯСУМКАОНВРУКАХДЕРЖАЛОФИЦЕРСКУЮШПАГУВСЛЕДСТВИЕЭТОГОСТРАШНОГОГУЛАШУМАПОТРЕБНОСТИВНИМАНИЯИДЕЯТЕЛЬНОСТИТУШИННЕИСПЫТЫВАЛНИМАЛЕЙШЕГОНЕПРИЯТНОГОЧУВСТВАСТРАХАИМЫСЛЬЧТОЕГОМОГУТУБИТЬИЛИБОЛЬНОРАНИТЬНЕПРИХОДИЛАЕМУВГОЛОВУНАПРОТИВЕМУСТАНОВИЛОСЬВСЕВЕСЕЛЕЕИВЕСЕЛЕЕЕМУКАЗАЛОСЬЧТОУЖЕОЧЕНЬДАВНОЕДВАЛИНЕВЧЕРАБЫЛАТАМИНУТАКОГДАОНУВИДЕЛНЕПРИЯТЕЛЯИСДЕЛАЛПЕРВЫЙВЫСТРЕЛИЧТОКЛОЧОКПОЛЯНАКОТОРОМОНСТОЯЛБЫЛЕМУДАВНОЗНАКОМЫМРОДСТВЕННЫММЕСТОМВЕТЕРСТИХЧЕРНЫЕТУЧИНИЗКОНАВИСЛИНАДМЕСТОМСРАЖЕНИЯСЛИВАЯСЬНАГОРИЗОНТЕСПОРОХОВЫМДЫМОМСТАНОВИЛОСЬТЕМНОИТЕМЯСНЕЕОБОЗНАЧАЛОСЬВДВУХМЕСТАХЗАРЕВОПОЖАРОВКАНОНАДАСТАЛАСЛАБЕЕНОТРЕСКОТНЯРУЖЕЙСЗАДИИСПРАВАСЛЫШАЛАСЬЕЩЕЧАЩЕИБЛИЖЕКАКТОЛЬКОТУШИНСОСВОИМИОРУДИЯМИОБЪЕЗЖАЯИНАЕЗЖАЯНАРАНЕНЫХВЫШЕЛИЗПОДОГНЯИСПУСТИЛСЯВОВРАГЕГОВСТРЕТИЛОНАЧАЛЬСТВОИАДЪЮТАНТЫВЧИСЛЕКОТОРЫХБЫЛИИШТАБОФИЦЕРИЖЕРКОВДВАРАЗАПОСЛАННЫЙИНИРАЗУНЕДОЕХАВШИЙДОБАТАРЕИТУШИНАВСЕОНИПЕРЕБИВАЯОДИНДРУГОГООТДАВАЛИИПЕРЕДАВАЛИПРИКАЗАНИЯКАКИКУДАИТТИИДЕЛАЛИЕМУУПРЕКИИЗАМЕЧАНИЯТУШИННИЧЕМНЕРАСПОРЯЖАЛСЯИМОЛЧАБОЯСЬГОВОРИТЬПОТОМУЧТОПРИКАЖДОМСЛОВЕОНГОТОВБЫЛСАМНЕЗНАЯОТЧЕГОЗАПЛАКАТЬЕХАЛСЗАДИНАСВОЕЙАРТИЛЛЕРИЙСКОЙКЛЯЧЕХОТЯРАНЕНЫХВЕЛЕНОБЫЛОБРОСАТЬМНОГОИЗНИХТАЩИЛОСЬЗАВОЙСКАМИИПРОСИЛОСЬНАОРУДИЯПРОШЛОДВАМЕСЯЦАПОСЛЕПОЛУЧЕНИЯИЗВЕСТИЙВЛЫСЫХГОРАХОБАУСТЕРЛИЦКОМСРАЖЕНИИИОПОГИБЕЛИКНЯЗЯАНДРЕЯИНЕСМОТРЯНАВСЕПИСЬМАЧЕРЕЗПОСОЛЬСТВОИНАВСЕРОЗЫСКИТЕЛОЕГОНЕБЫЛОНАЙДЕНОИЕГОНЕБЫЛОВЧИСЛЕПЛЕННЫХХУЖЕВСЕГОДЛЯЕГОРОДНЫХБЫЛОТОЧТООСТАВАЛАСЬВСЕТАКИНАДЕЖДАНАТОЧТООНБЫЛПОДНЯТЖИТЕЛЯМИНАПОЛЕСРАЖЕНИЯИМОЖЕТБЫТЬЛЕЖАЛВЫЗДОРАВЛИВАЮЩИЙИЛИУМИРАЮЩИЙГДЕНИБУДЬОДИНСРЕДИЧУЖИХИНЕВСИЛАХДАТЬОСЕБЕВЕСТИКНЯЖНАМАРЬЯСИДЕЛАОДНАВСВОЕЙКОМНАТЕПРИСЛУШИВАЯСЬКЗВУКАМДОМАИЗРЕДКАОТВОРЯЯДВЕРЬКОГДАПРОХОДИЛИМИМОИПРИГЛЯДЫВАЯСЬКТОМУЧТОПРОИСХОДИЛОВКОРИДОРЕНЕСКОЛЬКОЖЕНЩИНТИХИМИШАГАМИПРОХОДИЛИТУДАИОТТУДАОГЛЯДЫВАЛИСЬНАКНЯЖНУИОТВОРАЧИВАЛИСЬОТНЕЕОНАНЕСМЕЛАСПРАШИВАТЬЗАТВОРЯЛАДВЕРЬВОЗВРАЩАЛАСЬКСЕБЕИТОСАДИЛАСЬВСВОЕКРЕСЛОТОБРАЛАСЬЗАМОЛИТВЕННИКТОСТАНОВИЛАСЬНАКОЛЕНАПРЕДКИОТОМУЧАСТИЕРОСТОВАВДУЭЛИДОЛОХОВАСБЕЗУХОВЫМБЫЛОЗАМЯТОСТАРАНИЯМИСТАРОГОГРАФАИРОСТОВВМЕСТОТОГОЧТОБЫБЫТЬРАЗЖАЛОВАННЫМКАКОНОЖИДАЛБЫЛОПРЕДЕЛЕНАДЪЮТАНТОМКМОСКОВСКОМУГЕНЕРАЛГУБЕРНАТОРУВСЛЕДСТВИЕЭТОГООННЕМОГЕХАТЬВДЕРЕВНЮСОВСЕМСЕМЕЙСТВОМАОСТАВАЛСЯПРИСВОЕЙНОВОЙДОЛЖНОСТИВСЕЛЕТОВМОСКВЕДОЛОХОВВЫЗДОРОВЕЛИРОСТОВОСОБЕННОСДРУЖИЛСЯСНИМВЭТОВРЕМЯЕГОВЫЗДОРОВЛЕНИЯ
"""

# strDecrypt = """
# ЮРЬЙЖ КБМПО ЬЛФКЯ ЖКЬЗГ ЦЗЭЦУ КПДЭЖ ЫЦДЩН ШЦЮЦО ЖИЬОФ ЭЗЦРЦ СЬЫБЭ ЖГЖШЖ ДЦЖАК НРФКК ЬБШФЭ
# ТДЖСЦ ЭЦРПЩ НКФЕМ ПОЦШГ ФКЬШИ ЬЭТУФ ОЦГФС ДФШОЖ ЭФОТК ЦЗЭТФ ФШГЖЛ ФКЖЕЖ ЮЦГЦР ЬЫРЦЖ ЗЩЦШЖ
# ГВЬБЦ ЭЗОЬМ ЦЗЭЖЗ ЖОЫРЖ ШЬГЬО ЬФЕАК ЬУЖЭФ ОТКПЕ ГЖШГК НВЬГВ ЖЕНГЬ ЛФКЖФ СКБЮЖ КБЬКК ЬДЖЩЬ
# ЕОЦГК ЬШРНМ ФИСЬБ СЬСШЦ ДЬВКЖ ЕУФОЦ ГФСЗЖ ШФОЬЭ НЭЛФЫ ЦДЦЮЬ БГШФО ФЫРЖК ЖДЬКЖ БЖАЬК ЖДЬКЖ
# БРЬАЮ ЦГЦРЦ ДЮЦЗЭ ФЕ
# """

# strDecrypt = strDecrypt.replace("Ъ", "ь")

# lst_temp = [
#     317,
#     286,
#     276,
#     311,
#     333,
#     265,
#     380,
#     300,
#     368,
#     257,
#     322,
#     329,
#     290,
#     285,
#     310,
#     351,
#     250,
#     314,
#     304,
#     365,
#     326,
#     299,
#     303,
#     269,
#     301,
#     371,
#     341,
#     374,
#     413,
#     302,
#     365,
#     350,
#     339,
# ]


def tao_danh_sach_key_1(strDecrypt):
    arrTS_enc = [0] * 32
    for elem in strDecrypt:
        arrTS_enc[ord(elem) - ord_A] += 1
    tu_dien_enc = {i: arrTS_enc[i] for i in range(len(arrTS_enc))}
    # print(tu_dien)
    danh_sach_key_enc = sorted(tu_dien_enc, key=tu_dien_enc.get, reverse=True)
    # print(danh_sach_key_enc)
    return danh_sach_key_enc


def tao_table_2_chieu_bigram_loai1(strDecrypted):
    Denta_enc = [[0] * 32 for i in range(32)]
    for i in range(len(strDecrypted) - 1):
        f, l = ord(strDecrypted[i]) - ord_A, ord(strDecrypted[i + 1]) - ord_A
        # if f > 26:
        #     f -= 1
        # if l > 26:
        #     l -= 1
        # if f == 26 or l == 26:
        #     continue
        Denta_enc[f][l] += 1
    s_Denta = 0
    for el in Denta_enc:
        s_Denta += sum(el)
    for r in Denta_enc:
        for cl in range(len(r)):
            r[cl] /= s_Denta
    return Denta_enc


def hoan_vi_hang_cot(danh_sach_key_enc, Denta_enc):
    danh_sach_da_dao_Denta = []
    danh_sach_da_dao_Denta = [Denta_enc[i] for i in danh_sach_key_enc]
    danh_sach_da_dao_Denta = [
        [hang[i] for i in danh_sach_key_enc] for hang in danh_sach_da_dao_Denta
    ]
    return danh_sach_da_dao_Denta


def write_tofile(danh_sach_key_de_so_sanh, danh_sach_key_enc):
    tableThayThe_enc = []
    tableThayThe_enc = [chr(elem + ord_A) for elem in danh_sach_key_enc]
    tableThayThe2 = [chr(elem + ord_A) for elem in danh_sach_key_de_so_sanh]

    # print(strEncr)
    my_dict_decript = dict(zip(tableThayThe_enc, tableThayThe2))
    with open("result_chinhxac.txt", "w", encoding="utf-8") as f:
        f.write("================================\n\n")
        for st in strDecrypt:
            f.write(my_dict_decript[st])


def buoc_cuoi_thu_cac_hoan_vi(
    danh_sach_key_de_so_sanh,
    mang_ts_de_so_sanh,
    danh_sach_da_dao_Denta,
    rs,
):
    i = 0
    check = False
    while i < 31:
        if check:
            i = 0
            check = False
        for j in range(1, 32 - i):
            # print(danh_sach_key_de_so_sanh)
            danh_sach_key2_cp = danh_sach_key_de_so_sanh.copy()
            temp_k = danh_sach_key_de_so_sanh[i]
            danh_sach_key2_cp[i] = danh_sach_key2_cp[i + j]
            danh_sach_key2_cp[i + j] = temp_k
            # print(danh_sach_key2_cp)
            danh_sach_da_dao_B = hoan_vi_hang_cot(danh_sach_key2_cp, mang_ts_de_so_sanh)
            rs_temp = 0
            for r in range(len(danh_sach_da_dao_B)):
                for l in range(len(danh_sach_da_dao_B[r])):
                    rs_temp += abs(
                        danh_sach_da_dao_B[r][l] - danh_sach_da_dao_Denta[r][l]
                    )
            if rs_temp < rs:
                # print(danh_sach_key2)
                # print(i, j)
                # write_tofile(danh_sach_key2_cp.copy(), tableThayThe_enc.copy())
                # print(danh_sach_key2)
                check = True
                i = 0
                # print(danh_sach_key_de_so_sanh)
                danh_sach_key_de_so_sanh = danh_sach_key2_cp.copy()
                # print(danh_sach_key_de_so_sanh)
                # mang_ts_de_so_sanh = danh_sach_da_dao_B.copy()
                # print(rs, rs_temp)
                rs = rs_temp
                # print("Hoan doi")
                break
        i += 1
    return danh_sach_key_de_so_sanh, rs


def support_main(variant, str_template, danh_sach_da_dao_Denta):
    # print(f"variant : {variant}")
    sum_variant = sum(lst_temp[: variant - 1])
    str_template = str_template[sum_variant : sum_variant + lst_temp[variant]]
    # print(str_template)

    ## buoc 1
    danh_sach_key_de_so_sanh = tao_danh_sach_key_1(str_template)

    # buoc 2
    mang_ts_de_so_sanh = tao_table_2_chieu_bigram_loai1(str_template)

    # buoc 3

    danh_sach_da_dao_B = hoan_vi_hang_cot(danh_sach_key_de_so_sanh, mang_ts_de_so_sanh)
    # print("len danh sach B ", len(danh_sach_da_dao_B))
    rs = 0
    for i in range(len(danh_sach_da_dao_Denta)):
        for j in range(len(danh_sach_da_dao_Denta[i])):
            rs += abs(danh_sach_da_dao_Denta[i][j] - danh_sach_da_dao_B[i][j])
    # print(rs)
    danh_sach_key_de_so_sanh, rs = buoc_cuoi_thu_cac_hoan_vi(
        danh_sach_key_de_so_sanh,
        mang_ts_de_so_sanh,
        danh_sach_da_dao_Denta,
        rs,
    )
    return rs, danh_sach_key_de_so_sanh


############################################ End phan viet ham #########################################


################################ Begin body #########################################
def main_process(list_variant, str_template):
    min_rs = 5
    danh_sach_key_enc = tao_danh_sach_key_1(strDecrypt)
    Denta_enc = tao_table_2_chieu_bigram_loai1(strDecrypted=strDecrypt)
    danh_sach_da_dao_Denta = hoan_vi_hang_cot(danh_sach_key_enc, Denta_enc)
    lst_danh_sach_key_de_so_sanh = []
    var_good = 0
    for num_var in list_variant:
        variant = num_var
        (
            rs,
            danh_sach_key_de_so_sanh,
        ) = support_main(variant, str_template, danh_sach_da_dao_Denta)
        if rs < min_rs:
            min_rs = rs
            var_good = num_var
        lst_danh_sach_key_de_so_sanh.append(danh_sach_key_de_so_sanh.copy())
    # print("lst_sssss: ", lst_danh_sach_key_de_so_sanh)
    # _, danh_sach_key_de_so_sanh = support_main(
    #     var_good, str_template, danh_sach_key_enc, danh_sach_da_dao_Denta
    # )
    danh_sach_key_de_so_sanh = lst_danh_sach_key_de_so_sanh[
        list_variant.index(var_good)
    ]
    print(f"{var_good} : do lenh : {min_rs}")
    for i in range(len(danh_sach_key_de_so_sanh)):
        print(chr(danh_sach_key_de_so_sanh[i] + ord_A), end=" ")
    print()
    for i in range(len(danh_sach_key_de_so_sanh)):
        print(chr(danh_sach_key_enc[i] + ord_A), end=" ")
    write_tofile(danh_sach_key_de_so_sanh, danh_sach_key_enc)


################################################################


################################################################
#
###############################################################
# for i in range(len(danh_sach_key_de_so_sanh)):
#     print(chr(danh_sach_key_de_so_sanh[i] + ord_A), end=" ")
# print()
# for i in range(len(danh_sach_key_de_so_sanh)):
#     print(chr(danh_sach_key_enc[i] + ord_A), end=" ")
strDecrypt = """
ЗЙЭЦЩ КЩЗЮИ ГИКЩЙ ИЪЭВН ЛЗИОН АЩЧАЬ ИПЗПЛ МБСВЗ ИНВНЙ ЭРЮКА ЩЗОАЖ КИНАЩ РЭЪПЭ ВАЙЮО ЩОИХЩ
ЖЩДАЗ ПЛЫОЭ ЗПЛЫЭ РЩПАВ РЮКЙЮ ВЩЪАШ РИКЩЪ ЛПЮШТ ОЩУЭВ ХПЭЙА КБОЮЦ АНЩОЪ АЦАГИ ПНЭЦА ВХЩЪЩ
ШОЩЫЦ АЪПЭВ АЙЩЫЩ КАЬЭО АЪЩКЭ ШРЮКО ИЙЮВЩ ЪАШЪЛ ПГЭЙЮ ШЦЩКЩ ЗЩШКЩ КЩЙИЪ ВЩНЪП ЮНЮЦЙ ЮПЭДИ
ОАИЦК АЬЭОЭ ЙИПЖО ИШЫЛР ИИЫЩЛ ДИХЩЪ ЭМЮЙЭ КАВБГ ИПОЮИ ЙЩКЩВ АЪААЙ ЩЙВИЦ КАЬИЙ ЮПЭДЭ КАВБВ
НПИЦА НИКБО ЩВНБА ЙЩВНЩ ПДИОО ЩВНБ
"""
# strDecrypt = input("Your strDecrypted : ")
lst_in_var = [i for i in range(1, 15)]

strDecrypt = strDecrypt.replace(" ", "")
strDecrypt = strDecrypt.replace("\n", "")
strDecrypt = strDecrypt.upper()
strDecrypt = strDecrypt.replace("\n", "").replace(" ", "")

str_template = str_template.replace("\n", "").replace(" ", "")
ord_A = ord("А")
lst_temp = [
    317,
    286,
    276,
    311,
    333,
    265,
    380,
    300,
    368,
    257,
    317,
    329,
    290,
    285,
    310,
    351,
    250,
    314,
    304,
    365,
    326,
    299,
    303,
    269,
    301,
    371,
    341,
    374,
    413,
    302,
    365,
    350,
    339,
]


main_process(lst_in_var, str_template=str_template)
